In [770]:
# Module 4.4.3 - Load and Read CSV Files
# Create a new Jupyter Notebook file in the "School_District_Analysis" 
# folder and rename it PyCitySchools.ipynb.

In [771]:
# Module 4.4.3 - Load and Read CSV Files
# To oad CSV file - Add dependency first
# Add the Pandas dependency.
import pandas as pd

In [772]:
# Module 4.4.3 - Load and Read CSV Files
# Declare two variables: one assigned to the schools_complete.csv file and one assigned to the students_complete.csv file.
# (These files are located in the Resources folder.) 
# Files to load
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

# How do you use the indirect path method to access the csv files?
# When we want to get the indirect path to a file, we use os.path.join() to load a file from somewhere in our directory.
# Will need to import the os module. 
# Add the dependencies.
#import pandas as pd
#import os

# Files to load
#school_data_to_load = os.path.join("Resources", "schools_complete.csv")
#student_data_to_load = os.path.join("Resources", "students_complete.csv")

In [773]:
# Module 4.4.3 - Load and Read CSV Files
# Previously, we used the pd.DataFrame() function to convert a list of dictionaries, as we have in these CSV files. 
# The read_csv() function makes it easier for us by converting the CSV file to a DataFrame.
# Read the school data file and store it in a Pandas DataFrame.
school_data_df = pd.read_csv(school_data_to_load)
school_data_df

    School ID            school_name      type  size   budget
0           0      Huang High School  District  2917  1910635
1           1   Figueroa High School  District  2949  1884411
2           2    Shelton High School   Charter  1761  1056600
3           3  Hernandez High School  District  4635  3022020
4           4    Griffin High School   Charter  1468   917500
5           5     Wilson High School   Charter  2283  1319574
6           6    Cabrera High School   Charter  1858  1081356
7           7     Bailey High School  District  4976  3124928
8           8     Holden High School   Charter   427   248087
9           9       Pena High School   Charter   962   585858
10         10     Wright High School   Charter  1800  1049400
11         11  Rodriguez High School  District  3999  2547363
12         12    Johnson High School  District  4761  3094650
13         13       Ford High School  District  2739  1763916
14         14     Thomas High School   Charter  1635  1043130

In [774]:
# To view the first five rows of a DataFrame, use the df.head() method after the DataFrame name. 
# To view the last five rows of a DataFrame, use the df.tail() method after the DataFrame name.
# To view any number of rows in a DataFrame, place a number inside the parentheses.
# For the above DataFrame, the code looks like this.
school_data_df.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [775]:
# Module 4.4.3 cont'd
# Read the Student Data File (Note we read the School Data file above)
# Now we'll read the student data file and store it in a Pandas DataFrame
# Read the student data file and store it in a Pandas DataFrame.
student_data_df = pd.read_csv(student_data_to_load)
student_data_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [776]:
# Module 4.4.4 - Commit Code to GitHub

In [777]:
# Module 4.5.1 - Findng Missing Values
# To determine whether there are missing values in large datasets, use the following Pandas methods 
# the count() method,  isnull() method, and  notnull() method.

In [778]:
# Module 4.5.1 - Count() Method
# With the count() method, we can get a count of the rows for each column containing data. By default, "null" values are not counted, so you can often quickly identify which columns have missing data.
# By default, "null" values are not counted
# Use the count() method on the school_data_df DataFrame.
# Determine if there are any missing values in the SCHOOL DATA
school_data_df.count()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

In [779]:
# Module 4.5.1 - Count() Method cont'd
# Use the count() method on the student_data df DataFrame
# Determine if there are any missing values in the STUDENT DATA
student_data_df.count()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [780]:
# Module 4.5.1 - The isnull() Method
# The Pandas library also has the isnull() method for determining empty rows. 
# When you apply the isnull() method to a column, Series, or a DataFrame, a Boolean value will be returned, either "True" for the row or rows that are empty, i.e., null,
# or "False" for the rows that are not empty.
# Use the isnull() method on the school_data_df DataFrame.
# Determine if there are any missing values in the school data.
school_data_df.isnull()

    School ID  school_name   type   size  budget
0       False        False  False  False   False
1       False        False  False  False   False
2       False        False  False  False   False
3       False        False  False  False   False
4       False        False  False  False   False
5       False        False  False  False   False
6       False        False  False  False   False
7       False        False  False  False   False
8       False        False  False  False   False
9       False        False  False  False   False
10      False        False  False  False   False
11      False        False  False  False   False
12      False        False  False  False   False
13      False        False  False  False   False
14      False        False  False  False   False

In [781]:
# Module 4.5.1 - The isnull() Method
# Now we'll use the same method on the student_data_df DataFrame.
# Determine if there are any missing values in the student data.
student_data_df.isnull()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...
39165,False,False,False,False,False,False,False
39166,False,False,False,False,False,False,False
39167,False,False,False,False,False,False,False
39168,False,False,False,False,False,False,False
39169,False,False,False,False,False,False,False

In [782]:
# Module 4.5.1 - Using the Sum() Method after the Isnull() Method
# he process of joining two or more methods or functions together that are separated by a period is called chaining.
# To get the total number of empty rows, or rows that are "True," we can use the Pandas sum() method after the isnull() method, like this:
# Determine if there are any missing values in the student data.
student_data_df.isnull().sum()

Student ID       0
student_name     0
gender           0
grade            0
school_name      0
reading_score    0
math_score       0
dtype: int64

In [783]:
# Module 4.5.1 - The notnull() Method
# When you apply the notnull() method to a column, Series, or a DataFrame, a Boolean will be returned: 
# "True" for the row or rows that are NOT empty, or "False" for the row or rows that are empty
# use the notnull() method on the school_data_df DataFrame. Run the following code:
# Determine if there are not any missing values in the school data.
school_data_df.notnull()

    School ID  school_name  type  size  budget
0        True         True  True  True    True
1        True         True  True  True    True
2        True         True  True  True    True
3        True         True  True  True    True
4        True         True  True  True    True
5        True         True  True  True    True
6        True         True  True  True    True
7        True         True  True  True    True
8        True         True  True  True    True
9        True         True  True  True    True
10       True         True  True  True    True
11       True         True  True  True    True
12       True         True  True  True    True
13       True         True  True  True    True
14       True         True  True  True    True

In [784]:
# Module 4.5.1 - The notnull() Methhod
# Determine if there are not any missing values in the student data.
student_data_df.notnull()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,True,True,True,True,True,True,True
1,True,True,True,True,True,True,True
2,True,True,True,True,True,True,True
3,True,True,True,True,True,True,True
4,True,True,True,True,True,True,True
...,...,...,...,...,...,...,...
39165,True,True,True,True,True,True,True
39166,True,True,True,True,True,True,True
39167,True,True,True,True,True,True,True
39168,True,True,True,True,True,True,True
39169,True,True,True,True,True,True,True

In [785]:
# Module 4.5.1 - Using the sum() Method after the notnull() Method
# Likee did with the student_data_df DataFrame, we can chain the notnull() method and the sum() method to get the sum of all the columns that are "True."
# Determine if there are not any missing values in the student data.
student_data_df.notnull().sum()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [786]:
# Module 4.5.7 - Fix the Students2019 Names
# Switched from 4.5.6 cleaning_student_data.ipynb to PyCitySchools.ipynb file
# to fix the student names
# Switched from cleaning_data.ipynb file to PyCitySchools.ipynb file for this module
# Reference 4.5.6 in the cleaning_student_name.ipynb. For the previous data-cleaning step, we created a list to hold the common prefixes and suffixes as strings like this:
# prefixes_suffixes = ["Dr. ", "Mr. ","Ms. ", "Mrs. ", "Miss ", " MD", " DDS", " DVM", " PhD"]
# We iterated through the list and used the replace() method on
# the "student_name" column, replacing every occurrence of each
# prefix or suffix as they occurred with an empty string.
# Similar to the code we used in the cleaning_student_names.ipynb file.


# load and read student_data
student_data_to_load = "Resources/students_complete.csv"
student_data_df = pd.read_csv(student_data_to_load)
student_data_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [787]:
# Module 4.5.7 
# Add each prefix and suffix to remove to a list.
prefixes_suffixes = ["Dr. ", "Mr. ","Ms. ", "Mrs. ", "Miss ", " MD", " DDS", " DVM", " PhD"]

# Iterate through the words in the "prefixes_suffixes" list and replace them with an empty space, "".
for word in prefixes_suffixes:
    student_data_df["student_name"] = student_data_df["student_name"].str.replace(word,"")

# Print the first 10 rows of student_data_df
student_data_df

<ipython-input-787-8cadf242a90d>:7: FutureWarning: The default value of regex will change from True to False in a future version.
  student_data_df["student_name"] = student_data_df["student_name"].str.replace(word,"")

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84
...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,99,90
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75

In [788]:
# 4.5.8 - Commit your code
# 4.6.1 - Download copy of clean_students_complete.csv

In [789]:
# Module 4.7.1 - Merge DataFrames
# In order to get all of this data organized in one table, we'll need to merge the two DataFrames and perform analysis 
# on the single, merged DataFrame. 
# Although we'll be merging the DataFrames, it may be more efficient to use either school_data_df or student_data_df when performing certain calculations.
# It's a best practice to create a new DataFrame to do calculations even though
# we can perform analysis on both DataFrames so original data is not affected.
# We will merge school_data_df and student_data_df on a shared column using the 
# merge() method. The column that these two dataframes have in common is
# school_name

In [790]:
# 4.7.1 - Merge DataFrame
# Create a new DataFrame for the merged DaraFrames called school_data_complete_df
# The new DataFrame is created as a result of merging DataFrames #2 school_data_df
# which is the "right" DataFrame, into DataFrame #1
# student_data_df, which is the "left" DataFrame.
# "left" and "right" DataFranes reflect the order they appear inside the parentheses.

# Combine the data into a single dataset.
school_data_complete_df = pd.merge(student_data_df, school_data_df, on=["school_name", "school_name"])
school_data_complete_df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [830]:
# 4.7.2 - Get the Number of Students
# Now get the total number of students in the school district now that you
# have merged the DataFrames (above)
# Add the count() method to the school_data_complete_df
# Get the total number of students.
student_count = school_data_complete_df["Student ID"].count()
student_count

# Note - we can choose any one of the columns and get the student count using the following format:
# school_data_complete_df[column].count()

39170

In [831]:
# 4.7.2 - Get the Number of Students (cont'd from above)
# To assign the "student_count" to a column that identifies with students, we will use the "Student ID" column.
# Get the total number of students
school_data_complete_df["Student ID"].count()

39170

In [793]:
# 4.7.3 - Get the Number of Schools
# Remember we found the total number of schools by using the count() method on the school_data_df DataFrame. 
# The output was 15.

In [794]:
# 4.7.3 
# There are 2 wasy to get the number of schools
# One is to the schoold_data_df and assign a variable to one of the columns
# in the DataFrame like this
# Calculate the total number of schools.
school_count = school_data_df["school_name"].count()
school_count

15

In [795]:
# 4.7.3 
# There are 2 wasy to get the number of schools
# Another way is first need to get the unique items in the ["school_name"] 
# column is by using the unique() method. Can't use the count() method on school_data_complete_df["school_name"]
# because this would give us value of 39,170 bc we are using student_ID
# Calculate the total number of schools
school_count_2 = school_data_complete_df["school_name"].unique()
school_count_2

array(['Huang High School', 'Figueroa High School', 'Shelton High School',
       'Hernandez High School', 'Griffin High School',
       'Wilson High School', 'Cabrera High School', 'Bailey High School',
       'Holden High School', 'Pena High School', 'Wright High School',
       'Rodriguez High School', 'Johnson High School', 'Ford High School',
       'Thomas High School'], dtype=object)

In [796]:
# 4.7.4 - Get the Total Budget
# Look at the school_data_complete_df
# Use the sum() method on the school_data_df["budget"] column and NOT
# on the school_data_complete_df["budget"] column
# Calculate the total budget.
total_budget = school_data_df["budget"].sum()
total_budget

24649428

In [797]:
# 4.7.5 - Get the Score Average
# open student_data.csv file 
# Using the school_data_complete_df DataFrame,
# Calculate the average reading score.
average_reading_score = school_data_complete_df["reading_score"].mean()
average_reading_score

81.87784018381414

In [798]:
# 4.7.5 - Get the Score Average
# Find the Average Math Score
# Calculate the average math score.
average_math_score = school_data_complete_df["math_score"].mean()
average_math_score

78.98537145774827

In [799]:
# 4.7.6 - Get the Passing Percentages
# Determine the passing grade
# To do this, in a new cell, assign a passing_math variable to the math_score 
# column in school_data_complete_df, where all the math scores are equal to or greater than 70.

passing_math = school_data_complete_df["math_score"] >= 70
passing_math

0         True
1        False
2        False
3        False
4         True
         ...
39165     True
39166     True
39167     True
39168     True
39169     True
Name: math_score, Length: 39170, dtype: bool

In [800]:
# 4.7.6 - Get the Passing Percentages
# Determine the passing grade
passing_reading = school_data_complete_df["reading_score"] >= 70
passing_reading

0        False
1         True
2         True
3        False
4         True
         ...
39165     True
39166     True
39167     True
39168     True
39169     True
Name: reading_score, Length: 39170, dtype: bool

In [801]:
# 4.7.6 - Get the Passing Percentages
# Get number of student who passed math and reading
# We can filter the school_data_complete_df DataFrame
# Get all the students who are passing math in a new DataFrame.
passing_math = school_data_complete_df[school_data_complete_df["math_score"] >= 70]
passing_math.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635

In [802]:
# 4.7.6 - Get the Passing Percentages
# Get number of student who passed math and reading cont'd
# repurpose the code we wrote to calculate passing_math in order to find passing_reading, 
# but we'll switch out math_score with reading_score
# Get all the students that are passing reading in a new DataFrame.
passing_reading = school_data_complete_df[school_data_complete_df["reading_score"] >= 70]
passing_reading.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635

In [803]:
# 4.7.6 - Get the Passing Percentages
# To get the number of students who passed math and reading, apply count() method
# to the student_name column of the passing_math and passing_reading DataFrames

# Calculate the number of students passing math.
passing_math_count = passing_math["student_name"].count()
passing_math_count

# Calculate the number of students passing reading.
# passing_reading_count = passing_reading["student_name"].count()
# passing_reading_count

29370

In [804]:
# 4.7.6 - Get the Passing Percentages
# Calculate the number of students passing reading.
passing_reading_count = passing_reading["student_name"].count()
passing_reading_count

33610

In [805]:
# 4.7.6 - Get the Passing Percentages
# Get the percentage of students who passes math and reading
# Recalll that the student count was calculated using
# school_data_complete_df["Student ID"].count()
# Since we are calculating a percentage, we need to convert the student_count
# to a number with a decimal, or floating-point decimal, by using float().

In [806]:
# 4.7.6 - Get the Passing Percentages
# Finally, we calculate the percentage of students who 
# passed both math and reading 
# Calculate the overall passing percentage.
overall_passing_percentage = overall_passing_math_reading_count / student_count * 100
overall_passing_percentage

65.17232575950983

In [807]:
# 4.7.6 - Get the Passing Percentages
# Get the percentage of students who passes math and reading
# Calculate the percent that passed math.
passing_math_percentage = passing_math_count / float(student_count) * 100
print(passing_math_percentage)

# Calculate the percent that passed reading.
passing_reading_percentage = passing_reading_count / float(student_count) * 100
print(passing_reading_percentage)

74.9808526933878
85.80546336482001

In [808]:
# 4.7.6 - Calculate overall passing percentage
# Filter the school_data_complete_df DataFrame by adding the
# school_data_complete_df["math_score"] >= 70 and school_data_complete_df["reading_score"] >= 70 with the logical operator "&" within brackets
# Calculate the students who passed both math and reading.
passing_math_reading = school_data_complete_df[(school_data_complete_df["math_score"] >= 70) & (school_data_complete_df["reading_score"] >= 70)]

passing_math_reading.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635
9,9,Matthew Greene,M,10th,Huang High School,96,84,0,District,2917,1910635

In [809]:
# 4.7.6 - Calculate overall passing percentage
# Next, we'll get the total number of students who passed both math and reading.
# Calculate the number of students who passed both math and reading.
overall_passing_math_reading_count = passing_math_reading["student_name"].count()
overall_passing_math_reading_count

25528

In [810]:
# 4.7.7 - Create a District Summary DataFrame
# Now add the following values and columns to a create a new DataFrame named
# district_summary_df
# one way to create a new DataFrame is to convert a list of dictionaries to a DataFrame.
# To create a district_summary_df DataFrame we will create a list of dictionaries
# Adding a list of values with keys to create a new DataFrame.
district_summary_df = pd.DataFrame([{"Total Schools": school_count,"Total Students": student_count,"Total Budget": total_budget,
          "Average Math Score": average_math_score,"Average Reading Score": average_reading_score,
          "% Passing Math": passing_math_percentage,"% Passing Reading": passing_reading_percentage,"% Overall Passing": overall_passing_percentage}])
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,65.172326

In [811]:
# 4.7.8 - Format Columns
# clean up the district_summary_df DataFrame
# Use functions instead or algorithms to perform repetitive task
# Define the function "say_hello" so it prints "Hello!" when called.
def say_hello():
    print("Hello!")
    
# Call the function.
say_hello()
    
# def keyword, which is short for "define," and is used to create the function
# function name, say_hello(), is always written after def.
# Call the function to print "Hello"
# A parameter is a value or variable that we send to the function ()

Hello!

In [812]:
# 4.7.8 - Format Columns
# Functions
# Define the function "say_something" so it prints whatever is passed as the variable when called.
def say_something(something):
    print(something)

In [813]:
# 4.7.8 - Format Columns
# Functions
# add a parameter inside the parentheses of a new function, say_something(). 
# Inside the parentheses, we added the variable something
# doesn't have to be the word "something"; it can be whatever you want it to be
def say_something(something):
     print(something)
        
Jane_says = "Hi, my name is Jane. I'm learning Python!"
say_something(Jane_says)

Hi, my name is Jane. I'm learning Python!

In [814]:
# 4.7.8 - Format Columns
# Functions
# Write a function to get the percentage of students who passed math
# when we know the number of students that passed math, pass_match_count
# and the total number of students for a school district, student_count
# we can define this function as passing)_match_percent
# Define a function that calculates the percentage of students that passed both # math and reading and prints the passing percentage to the output when the
# function is called.
def passing_math_percent(pass_math_count, student_count):
    return pass_math_count / float(student_count) * 100
passing_math_count

# We added two values to the passing_math_percent function: pass_math_count and student_count
# We added return in front of the calculation for the passing percentage.
# return statement causes the function to end and literally "returns" what is in front of the statement back to the caller,

29370

In [815]:
# 4.7.8 - Format Columns
# Functions - contd
# Assign values to the passing_math_count and total_student_count variables
passing_math_count = 29370
total_student_count = 39170

In [816]:
# 4.7.8 - cont'd
# Call the function.
passing_math_percent(passing_math_count, total_student_count)

74.9808526933878

In [817]:
# 4.7.8  - Panda map() Function
# map() function is used for substituting each value in a Series with another value
# module tells us to create the functions.ipynb file and run the functions 
# bur including it in PyCitySchools.ipynb

In [818]:
# A list of my grades.
my_grades = ['B', 'C', 'B' , 'D']

In [819]:
# Import pandas.
import pandas as pd
# Convert the my_grades to a Series
my_grades = pd.Series(my_grades)
my_grades

0    B
1    C
2    B
3    D
dtype: object

In [820]:
# 4.7.8
# Using the map() function we will change B to A, C to B
# and D to C
# To change each string value in this Series to another value use this format:
# map("current_value_1" : "new_value_1",  "current_value_2" : "new_value_2", etc)
# Change the grades by one letter grade.
my_grades.map({'B': 'A', 'C': 'B', 'D': 'C'})

0    A
1    B
2    A
3    C
dtype: object

In [821]:
# 4.7.8 - Format Columns
# Python format() Function
# Python format() function is used to format a value to a specific format
# such as one or two decimal places, or adding a thousands separator. 
# "{value:format specification}".format(value)
# Using the format() function.
my_grades = [92.34, 84.56, 86.78, 98.32]

# Iterate through the grades
# Pass the grade variable inside the format () function
# Specify the format for the grade variable
for grade in my_grades:
    print("{:.0f}".format(grade))

92
85
87
98

In [822]:
# 4.7.8 - Format columns
# Chaining the map() and format() functions
# Convert the numerical grades to a Series.
my_grades = pd.Series([92.34, 84.56, 86.78, 78.32])
my_grades

0    92.34
1    84.56
2    86.78
3    78.32
dtype: float64

In [823]:
# 4.7.8 - Format columns
# Chaining the map() and format() functions
# Format the grades to the nearest whole number percent.
my_grades.map("{:.0f}".format)

0    92
1    85
2    87
3    78
dtype: object

In [824]:
# 4.7.8 - Format columns
# we can format the dollar amounts in the district_summary_df columns to two decimal places with a U.S. dollar sign
# df["column"] = df["column"].map("{:,}".format) 

# Format the "Total Students" to have the comma for a thousands separator.
district_summary_df["Total Students"] = district_summary_df["Total Students"].map("{:,}".format)

district_summary_df["Total Students"]

0    39,170
Name: Total Students, dtype: object

In [825]:
# 4.7.8 - Format columns
# Format "Total Budget" to have the comma for a thousands separator, a decimal separator, and a "$".

district_summary_df["Total Budget"] = district_summary_df["Total Budget"].map("${:,.2f}".format)

district_summary_df["Total Budget"]

0    $24,649,428.00
Name: Total Budget, dtype: object

In [826]:
# 4.7.8 - Format columns
# Reformat the remaining columns
# Format the columns.
district_summary_df["Average Math Score"] = district_summary_df["Average Math Score"].map("{:.1f}".format)

district_summary_df["Average Reading Score"] = district_summary_df["Average Reading Score"].map("{:.1f}".format)

district_summary_df["% Passing Math"] = district_summary_df["% Passing Math"].map("{:.0f}".format)

district_summary_df["% Passing Reading"] = district_summary_df["% Passing Reading"].map("{:.0f}".format)

district_summary_df["% Overall Passing"] = district_summary_df["% Overall Passing"].map("{:.0f}".format)

In [827]:
# 4.7.9 Reorder Columns
# Reorder the columns in the order you want them to appear.
new_column_order = ["Total Schools", "Total Students", "Total Budget","Average Math Score", "Average Reading Score", "% Passing Math", "% Passing Reading", "% Overall Passing"]

# Assign district summary df the new column order.
district_summary_df = district_summary_df[new_column_order]
district_summary_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",79.0,81.9,75,86,65

In [828]:
# 4.8.1 - Set the Indec to the School Name
# create a new DataFram
# the index needs to be the school_name with "School Type" as the first column. 
# we will use data from the school_data_df DataFrame becuase
# "school_name" and :type" columns are both Series

In [829]:
# Determine the school type.
per_school_types = school_data_df.set_index(["school_name"])["type"]
per_school_types

# We are setting the index to the school_name column wiht the set_index
# method

school_name
Huang High School        District
Figueroa High School     District
Shelton High School       Charter
Hernandez High School    District
Griffin High School       Charter
Wilson High School        Charter
Cabrera High School       Charter
Bailey High School       District
Holden High School        Charter
Pena High School          Charter
Wright High School        Charter
Rodriguez High School    District
Johnson High School      District
Ford High School         District
Thomas High School        Charter
Name: type, dtype: object